ws-asahi/UkiUkiCore/megaavr/variants/WazamonoTachi/pins_arduino.h
/* pins_arduino.h - Variant definition for the Wazamono Tachi (AVR64DU32)
 * ---------------------------------------------------------------------------
 * Part of WazamonoCore (a product-specific fork of SpenceKonde/DxCore).
 * DxCore is (C) Spence Konde 2021-2022, open source (LGPL 2.1, see LICENSE.md),
 * based on existing Arduino cores. This variant (C) Workshop Asahi 2026.
 *
 * Board   : Wazamono Tachi  (Pro Micro form factor, AVR64DU32, USB-C)
 * MCU     : AVR64DU32  (TQFP-32; rev.4 returned from the 28-pin part to the
 *           32-pin part - routing needed the TQFP, and the 28-pin variant
 *           saved almost nothing while costing features)
 * Clock   : internal 24 MHz OSCHF, crystal-less (boards.txt: clocksource = 0).
 *           USB CLK_USB (48 MHz) = OSCHF + PLL48M, auto-tuned to the USB SOF.
 *           PA0/PA1 (XTALHF pins) carry the TX/RX activity LEDs - see below.
 *
 *  ===== Pin numbering: Pro Micro compatible (NONCANONICAL), rev.5 =====
 *  (source: WazamonoTachi_Schematics.net + WazamonoTachi_ProMicro互換用ピン構成.csv)
 *   D#   MCU   Pro Micro role / notes                        A#,  AIN
 *   D0   PA5   RX  (Serial1 = USART0 RX, ALT1)               A12, AIN25
 *   D1   PA4   TX  (Serial1 = USART0 TX, ALT1)               A13, AIN24
 *   D2   PA2   SDA (I2C)                                     A14, AIN22
 *   D3   PA3   SCL (I2C) | ~PWM(TCB1 WO, default outlet)     A15, AIN23
 *   D4   PC3   ~PWM(TCB1 via LUT1-OUT) | LUT1-OUT            A6,  AIN31
 *   D5   PD0   ~PWM(TCA0 WO0) | LUT2-IN0                     A16, AIN0
 *   D6   PD1   ~PWM(TCA0 WO1) | LUT2-IN1                     A7,  AIN1
 *   D7   PA6   ~PWM(TCB1 via LUT0-OUT alt) | USART0 XCK      A17, AIN26
 *   D8   PA7   USART0 XDIR | AC0 OUT | EVOUTA | CLKOUT       A8,  AIN27
 *   D9   PD2   ~PWM(TCA0 WO2) | LUT2-IN2 | AINP0 | EVOUTD    A9,  AIN2
 *   D10  PD3   ~PWM(TCA0 WO3) | LUT2-OUT | AINN0             A10, AIN3
 *   D11..D13   (do not exist - gap, like the 32U4 Pro Micro)
 *   D14  PD5   MISO | ~PWM(TCA0 WO5)                         A18, AIN5
 *   D15  PD6   SCK  | Serial2 TX (USART1 ALT2)               A19, AIN6
 *   D16  PD4   MOSI | ~PWM(TCA0 WO4)                         A20, AIN4
 *   D17  PF3   LED_BUILTIN (on-board user LED, active-LOW,
 *              no header) | LUT3-OUT                         A21, AIN19
 *   D18  PD7   A0 | SPI SS | Serial2 RX (USART1 ALT2) | VREFA    AIN7
 *   D19  PF0   A1 | LUT3-IN0                                 AIN16
 *   D20  PF1   A2 | LUT3-IN1                                 AIN17
 *   D21  PF2   A3 | LUT3-IN2 | EVOUTF                        AIN18
 *   D22  PF4   A4 (test pad TP1 only, no header)             AIN20
 *   D23  PF5   A5 (test pad TP2 only, no header)             AIN21
 *   D24..D29   (do not exist - gap)
 *   D30  PA0   TX LED = LED_BUILTIN_TX (on-board, active-LOW, no header)
 *   D31  PA1   RX LED = LED_BUILTIN_RX (on-board, active-LOW, no header)
 *   --- not exposed as a numbered Dn (appended so the arrays are complete) ---
 *        PF6   RESET                                   index 32
 *        PF7   UPDI                                    index 33  (== PIN_PF7, highest)
 *
 *  ===== Peripheral routing (set by this variant + boards.txt) =====
 *   TCA0  -> PORTD (WO0..WO5 = PD0..PD5 = D5/D6/D9/D10/D16/D14) : TCA0_PINS below
 *            -> classic Pro Micro PWM set D3/D5/D6/D9/D10 is fully reproduced;
 *               D14/D16 gain bonus PWM (mutually exclusive with SPI use).
 *   TCB1  -> ONE waveform, THREE exclusive outlets (WAZAMONO_TCB1_PWMMUX):
 *            D3 = PA3 (TCB1 WO, default PORTMUX position, outlet = CCMPEN),
 *            D7 = PA6 (LUT0-OUT alternate position),
 *            D4 = PC3 (LUT1-OUT default position).
 *            The last analogWrite() among the three owns the route (default D3).
 *   millis-> TCB0  : boards.txt MUST pass -DMILLIS_USE_TIMERB0 so TCB1 is free for D3/D4/D7 PWM
 *   SPI0  -> ALT4 (PD4/PD5/PD6/PD7 = D16/D14/D15/D18), the ONLY position offered:
 *            the DEFAULT position (PA4..PA7) is occupied by USART0/Serial1.
 *            Board is SPI host; chip-selects are user GPIO (auto-SS not used).
 *   TWI0  -> default (PA2 SDA / PA3 SCL) = D2/D3, the Pro Micro I2C position.
 *            No UART sharing: Wire and Serial1/Serial2 can all run together.
 *   USART0-> Serial1, ALT1 (PA4 TX / PA5 RX / PA6 XCK / PA7 XDIR) = D1/D0/D7/D8.
 *            Full-function position: XCK/XDIR enable USART-SPI-host ("SPI1")
 *            and RS-485.
 *   USART1-> Serial2, ALT2 (PD6 TX / PD7 RX) = D15/D18. (Only usable USART1
 *            position.) Shares pins with SPI SCK/SS, so Serial2 and SPI are
 *            mutually exclusive (use one or the other).
 *   CCL   -> LUT0: OUT = D7 (alternate position; IN0/IN1 = PA0/PA1 are the
 *            TX/RX LEDs, IN2 = D2 is SDA - use internal/event inputs);
 *            LUT1: OUT = D4 (IN0..IN2 = PC0..PC2 do not exist on the 32-pin
 *            part - internal/event inputs only);
 *            LUT2: IN0/IN1/IN2 = D5/D6/D9, OUT = D10, alt OUT = D15;
 *            LUT3: IN0/IN1/IN2 = D19/D20/D21 (= A1/A2/A3), OUT = D17 (LED_BUILTIN).
 *   AREF  -> PD7 (VREFA) doubles as analog input A0 (D18). Using an external
 *            analog reference costs A0 (and SPI SS / Serial2 RX).
 *   LED   -> three on-board LEDs, all active-LOW (anode to +3V3 via 330R/1k):
 *            PF3 (D17) = LED_BUILTIN (dedicated user LED, not touched by the
 *            core); PA0 (D30) = TX LED = LED_BUILTIN_TX and PA1 (D31) = RX LED
 *            = LED_BUILTIN_RX (USB-CDC activity, driven by
 *            wazamono_tachi_init.cpp). Sketches may drive all three as GPIO.
 *   Serial-> native USB CDC (USBSerial), Leonardo/Micro convention.
 *
 *   NOTE on names: in DxCore USART0 is "Serial0" and USART1 is "Serial1".
 *   On this board the Pro Micro D0/D1 UART is USART0, so the user-facing name
 *   Serial1 must attach to USART0. WAZAMONO_SERIAL1_IS_USART0 (below) makes
 *   the core emit Serial1 as an alias of the Serial0 object (UART0.cpp), and
 *   WAZAMONO_SERIAL2_IS_USART1 renames USART1's object to Serial2 (UART1.cpp,
 *   HardwareSerial.h). Serial0 remains as the internal alias for USART0.
 */

#ifndef Pins_Arduino_h
#define Pins_Arduino_h
#include <avr/pgmspace.h>
#include "timers.h"

/* Board identification: ARDUINO_AVR_TACHI is THE macro that identifies this
 * board, following the Arduino convention (ARDUINO_AVR_PROMICRO, ARDUINO_UNOWIFIR4).
 * The Arduino build system defines it from boards.txt (build.board=AVR_TACHI
 * -> -DARDUINO_AVR_TACHI); the fallback below covers builds outside the IDE
 * (e.g. the bootloader tree, which passes it explicitly). It is used by the
 * core, the bundled libraries, the examples and the bootloader sources alike.
 * MCU identification comes from the compiler (-mmcu): __AVR_AVR64DU32__,
 * plus the core's family tags __AVR_DU__ / _AVR_FAMILY / _AVR_PINCOUNT
 * (core_devices.h).
 * DU_32PIN_PINOUT keeps DU-32 feature assumptions in the core;
 * NONCANONICAL_PIN_NUMBERS tells the core to derive (port,bit) from the tables
 * below instead of assuming pin number == port order. */
#ifndef ARDUINO_AVR_TACHI
  #define ARDUINO_AVR_TACHI 1
#endif
#define DU_32PIN_PINOUT
#define NONCANONICAL_PIN_NUMBERS

/* ---- User-facing serial names (core support in UART0.cpp / UART1.cpp /
 * HardwareSerial.h; this header is included by Arduino.h *before* UART.h, so
 * these are visible to every core translation unit): ---------------------
 *   Serial1 -> USART0 (D0/D1, the Pro Micro hardware UART)  [alias of Serial0]
 *   Serial2 -> USART1 (D15 TX / D18 RX)                     [renamed object]  */
#ifndef WAZAMONO_SERIAL1_IS_USART0
  #define WAZAMONO_SERIAL1_IS_USART0
#endif
#ifndef WAZAMONO_SERIAL2_IS_USART1
  #define WAZAMONO_SERIAL2_IS_USART1
#endif

         /*##  ### #   #  ###
          #   #  #  ##  # #
          ####   #  # # #  ###
          #      #  #  ##     #
          #     ### #   #  # */
/* Digital pin number for each MCU pin (Pro Micro layout, rev.5 / AVR64DU32). */
#define PIN_PA5 (0)   // D0  RX  (Serial1 = USART0 RX)
#define PIN_PA4 (1)   // D1  TX  (Serial1 = USART0 TX)
#define PIN_PA2 (2)   // D2  SDA
#define PIN_PA3 (3)   // D3  SCL / TCB1 PWM (WO, default outlet)
#define PIN_PC3 (4)   // D4  TCB1 PWM via LUT1-OUT
#define PIN_PD0 (5)   // D5  TCA0 WO0
#define PIN_PD1 (6)   // D6  TCA0 WO1
#define PIN_PA6 (7)   // D7  TCB1 PWM via LUT0-OUT (alt) / USART0 XCK
#define PIN_PA7 (8)   // D8  USART0 XDIR / AC0 OUT / EVOUTA / CLKOUT
#define PIN_PD2 (9)   // D9  TCA0 WO2 / AINP0 / EVOUTD
#define PIN_PD3 (10)  // D10 TCA0 WO3 / AINN0
//  no  D11..D13              (gap)
#define PIN_PD5 (14)  // D14 MISO / TCA0 WO5
#define PIN_PD6 (15)  // D15 SCK / Serial2 TX
#define PIN_PD4 (16)  // D16 MOSI / TCA0 WO4
#define PIN_PF3 (17)  // D17 LED_BUILTIN (active-LOW, on-board only) / LUT3-OUT
#define PIN_PD7 (18)  // D18 A0 / SPI SS / Serial2 RX / VREFA
#define PIN_PF0 (19)  // D19 A1 / LUT3-IN0
#define PIN_PF1 (20)  // D20 A2 / LUT3-IN1
#define PIN_PF2 (21)  // D21 A3 / LUT3-IN2 / EVOUTF
#define PIN_PF4 (22)  // D22 A4 (test pad only)
#define PIN_PF5 (23)  // D23 A5 (test pad only)
//  no  D24..D29              (gap)
#define PIN_PA0 (30)  // D30 TX LED = LED_BUILTIN_TX (active-LOW, on-board only)
#define PIN_PA1 (31)  // D31 RX LED = LED_BUILTIN_RX (active-LOW, on-board only)
#define PIN_PF6 (32)  // RESET
#define PIN_PF7 (33)  // UPDI  (highest index -> sets NUM_DIGITAL_PINS = 34)

/* ---- Event output pins: FIXED by the board's pin-configuration table ----
 * One pin per event output, no alternatives. Libraries (CustomLogic, and the
 * EventSystem library in its Wazamono form) route event outputs to these only.
 *   EVOUTA -> PA7 = D8   (PORTMUX ALT1;    default PA2 is the Grove SDA)
 *   EVOUTD -> PD2 = D9   (PORTMUX default)
 *   EVOUTF -> PF2 = D21  (PORTMUX default) */
#define WAZAMONO_EVOUTA_PIN            (PIN_PA7)
#define WAZAMONO_EVOUTA_ALT            (1)
#define WAZAMONO_EVOUTD_PIN            (PIN_PD2)
#define WAZAMONO_EVOUTD_ALT            (0)
#define WAZAMONO_EVOUTF_PIN            (PIN_PF2)
#define WAZAMONO_EVOUTF_ALT            (0)

         /*##   ##   ###  ###  ###  ###
          #   # #  # #      #  #    #
          ####  ####  ###   #  #     ###
          #   # #  #     #  #  #        #
          ####  #  # ####  ###  ###  # */
#define PINS_COUNT                     (34)  // length of the pin tables (incl. gaps/reserved)
#define NUM_ANALOG_INPUTS              (31)  // highest ADC channel in use is AIN31 (PC3)
// NUM_DIGITAL_PINS / NUM_TOTAL_PINS  -> auto = PIN_PF7 + 1 = 34
// NUM_INTERNALLY_USED_PINS           -> auto = 0 (crystal-less: no reserved GPIO)

#if !defined(LED_BUILTIN)
  #define LED_BUILTIN                  (PIN_PF3)   // D17, dedicated user LED (active-LOW)
#endif
#define LED_BUILTIN_TX                 (PIN_PA0)   // D30 = USB-CDC TX activity LED (active-LOW)
#define LED_BUILTIN_RX                 (PIN_PA1)   // D31 = USB-CDC RX activity LED (active-LOW)

/* 32U4 Leonardo / Pro Micro activity-LED helper macros, same semantics:
 * xxLED1 = ON, xxLED0 = OFF (both LEDs are active-LOW on this board too;
 * TX = PA0/D30, RX = PA1/D31). The 32U4 TX_RX_LED_INIT only touched DDR;
 * here OUT is set HIGH (= off) before DIR so the LEDs cannot flash on.
 * As on the 32U4 (USBCore.cpp), the core's own CDC activity one-shot
 * (wazamono_tachi_init.cpp) drives the same pins, so a sketch holding an
 * LED on with these macros will see the same brief fight over the pin. */
#define TX_RX_LED_INIT                 (PORTA.OUTSET = (PIN0_bm | PIN1_bm), \
                                        PORTA.DIRSET = (PIN0_bm | PIN1_bm))
#define TXLED1                         (PORTA.OUTCLR = PIN0_bm)   /* TX LED (PA0/D30) ON  */
#define TXLED0                         (PORTA.OUTSET = PIN0_bm)   /* TX LED (PA0/D30) OFF */
#define RXLED1                         (PORTA.OUTCLR = PIN1_bm)   /* RX LED (PA1/D31) ON  */
#define RXLED0                         (PORTA.OUTSET = PIN1_bm)   /* RX LED (PA1/D31) OFF */

#ifdef CORE_ATTACH_OLD
  #define EXTERNAL_NUM_INTERRUPTS      (48)
#endif

         /*   #  ###   ### ####   ###   ###
          ## ## #   # #    #   # #   # #
          # # # ##### #    ####  #   #  ###
          #   # #   # #    # #   #   #     #
          #   # #   #  ### #  #   ###   ## */
/* Explicit maps (NONCANONICAL numbering: arithmetic shortcuts cannot be used).
 * PA0/PA1 (the LEDs) have no ADC channel on the DU (AIN20..27 are PF4..PF7 and
 * PA2..PA7 - DS40002548B, ADC MUXPOS) and are not mapped. */
#define digitalPinToAnalogInput(p)  ( \
    (p) == PIN_PD0 ?  0 : (p) == PIN_PD1 ?  1 : (p) == PIN_PD2 ?  2 : (p) == PIN_PD3 ?  3 : \
    (p) == PIN_PD4 ?  4 : (p) == PIN_PD5 ?  5 : (p) == PIN_PD6 ?  6 : (p) == PIN_PD7 ?  7 : \
    (p) == PIN_PF0 ? 16 : (p) == PIN_PF1 ? 17 : (p) == PIN_PF2 ? 18 : (p) == PIN_PF3 ? 19 : \
    (p) == PIN_PF4 ? 20 : (p) == PIN_PF5 ? 21 : \
    (p) == PIN_PA2 ? 22 : (p) == PIN_PA3 ? 23 : (p) == PIN_PA4 ? 24 : (p) == PIN_PA5 ? 25 : \
    (p) == PIN_PA6 ? 26 : (p) == PIN_PA7 ? 27 : (p) == PIN_PC3 ? 31 : NOT_A_PIN )

#define analogChannelToDigitalPin(p)  ( \
    (p) ==  0 ? PIN_PD0 : (p) ==  1 ? PIN_PD1 : (p) ==  2 ? PIN_PD2 : (p) ==  3 ? PIN_PD3 : \
    (p) ==  4 ? PIN_PD4 : (p) ==  5 ? PIN_PD5 : (p) ==  6 ? PIN_PD6 : (p) ==  7 ? PIN_PD7 : \
    (p) == 16 ? PIN_PF0 : (p) == 17 ? PIN_PF1 : (p) == 18 ? PIN_PF2 : (p) == 19 ? PIN_PF3 : \
    (p) == 20 ? PIN_PF4 : (p) == 21 ? PIN_PF5 : \
    (p) == 22 ? PIN_PA2 : (p) == 23 ? PIN_PA3 : (p) == 24 ? PIN_PA4 : (p) == 25 ? PIN_PA5 : \
    (p) == 26 ? PIN_PA6 : (p) == 27 ? PIN_PA7 : (p) == 31 ? PIN_PC3 : NOT_A_PIN )

