ws-asahi/UkiUkiCore/megaavr/variants/WazamonoTachi/pins_arduino.h
         /*##  #   #  ###  #     ###   ###      ####  ### #   #  ###
          #   # ##  # #   # #    #   # #         #   #  #  ##  # #
          ##### # # # ##### #    #   # #  ##     ####   #  # # #  ###
          #   # #  ## #   # #    #   # #   #     #      #  #  ##     #
          #   # #   # #   # ####  ###   ###      #     ### #   #  # */
/* Arduino analog aliases (rev.5). A0..A3 = D18..D21 match the Pro Micro
 * exactly. A4/A5 = D22/D23 (PF4/PF5) also match the SparkFun promicro variant
 * numerically (A4 = 22, A5 = 23); there they are unrouted 32U4 pins, here they
 * are real ADC inputs on test pads TP1/TP2 (no header).
 * A6..A10 point at the same physical pins as on the Pro Micro
 * (D4/D6/D8/D9/D10) but carry those pins' OWN numbers (4/6/8/9/10), not the
 * Leonardo duplicate numbers 24..28; analogRead(A6) etc. behave identically,
 * only the numeric value of the alias differs (documented incompatibility).
 * There is NO A11 gap: the Leonardo reserves A11 for D12, which does not
 * exist on the Pro Micro pinout at all, so no sketch that runs on this
 * board can rely on it. The extension aliases therefore continue densely:
 * A11..A16 over D0/D1/D2/D3/D5/D7 and A17..A20 over D14..D17 (A# = D# + 3
 * in that group). D30/D31 (PA0/PA1, the LEDs) have no ADC. */
#define PIN_A0   (PIN_PD7)   // D18 (also SPI SS / Serial2 RX / VREFA)
#define PIN_A1   (PIN_PF0)   // D19
#define PIN_A2   (PIN_PF1)   // D20
#define PIN_A3   (PIN_PF2)   // D21
#define PIN_A4   (PIN_PF4)   // D22 (test pad TP1)
#define PIN_A5   (PIN_PF5)   // D23 (test pad TP2)
#define PIN_A6   (PIN_PC3)   // D4
#define PIN_A7   (PIN_PD1)   // D6
#define PIN_A8   (PIN_PA7)   // D8
#define PIN_A9   (PIN_PD2)   // D9
#define PIN_A10  (PIN_PD3)   // D10
#define PIN_A11  (PIN_PA5)   // D0
#define PIN_A12  (PIN_PA4)   // D1
#define PIN_A13  (PIN_PA2)   // D2
#define PIN_A14  (PIN_PA3)   // D3
#define PIN_A15  (PIN_PD0)   // D5
#define PIN_A16  (PIN_PA6)   // D7
#define PIN_A17  (PIN_PD5)   // D14
#define PIN_A18  (PIN_PD6)   // D15
#define PIN_A19  (PIN_PD4)   // D16
#define PIN_A20  (PIN_PF3)   // D17 (LED_BUILTIN)

/* --- Uno R4 style number-prefixed digital pin aliases ---
 * D-number == Arduino digital pin number. Internal-only pins (PF6 RESET,
 * PF7 UPDI) are intentionally NOT exposed as Dn. The on-board LEDs D17/D30/D31
 * and the test pads D22/D23 ARE exposed so sketches can drive them by number.
 * #undef guards clear any stray macro definitions, matching the Uno R4 pattern. */
#undef D0
#undef D1
#undef D2
#undef D3
#undef D4
#undef D5
#undef D6
#undef D7
#undef D8
#undef D9
#undef D10
#undef D14
#undef D15
#undef D16
#undef D17
#undef D18
#undef D19
#undef D20
#undef D21
#undef D22
#undef D23
#undef D30
#undef D31
static const uint8_t D0  = PIN_PA5;  // RX (Serial1)
static const uint8_t D1  = PIN_PA4;  // TX (Serial1)
static const uint8_t D2  = PIN_PA2;  // SDA
static const uint8_t D3  = PIN_PA3;  // SCL / ~PWM(TCB1 WO, default outlet)
static const uint8_t D4  = PIN_PC3;  // ~PWM(TCB1 via LUT1)
static const uint8_t D5  = PIN_PD0;  // ~PWM
static const uint8_t D6  = PIN_PD1;  // ~PWM
static const uint8_t D7  = PIN_PA6;  // ~PWM(TCB1 via LUT0 alt) / USART0 XCK
static const uint8_t D8  = PIN_PA7;  // USART0 XDIR / AC0 OUT / EVOUTA / CLKOUT
static const uint8_t D9  = PIN_PD2;  // ~PWM
static const uint8_t D10 = PIN_PD3;  // ~PWM
static const uint8_t D14 = PIN_PD5;  // MISO / ~PWM
static const uint8_t D15 = PIN_PD6;  // SCK / Serial2 TX
static const uint8_t D16 = PIN_PD4;  // MOSI / ~PWM
static const uint8_t D17 = PIN_PF3;  // LED_BUILTIN (active-LOW, on-board only)
static const uint8_t D18 = PIN_PD7;  // A0 / SPI SS / Serial2 RX
static const uint8_t D19 = PIN_PF0;  // A1
static const uint8_t D20 = PIN_PF1;  // A2
static const uint8_t D21 = PIN_PF2;  // A3 / EVOUTF
static const uint8_t D22 = PIN_PF4;  // A4 (test pad TP1)
static const uint8_t D23 = PIN_PF5;  // A5 (test pad TP2)
static const uint8_t D30 = PIN_PA0;  // TX LED = LED_BUILTIN_TX (active-LOW, on-board only)
static const uint8_t D31 = PIN_PA1;  // RX LED = LED_BUILTIN_RX (active-LOW, on-board only)

static const uint8_t A0   = PIN_A0;
static const uint8_t A1   = PIN_A1;
static const uint8_t A2   = PIN_A2;
static const uint8_t A3   = PIN_A3;
static const uint8_t A4   = PIN_A4;   // D22 / PF4 (test pad TP1)
static const uint8_t A5   = PIN_A5;   // D23 / PF5 (test pad TP2)
static const uint8_t A6   = PIN_A6;
static const uint8_t A7   = PIN_A7;
static const uint8_t A8   = PIN_A8;
static const uint8_t A9   = PIN_A9;
static const uint8_t A10  = PIN_A10;
static const uint8_t A11  = PIN_A11;
static const uint8_t A12  = PIN_A12;
static const uint8_t A13  = PIN_A13;
static const uint8_t A14  = PIN_A14;
static const uint8_t A15  = PIN_A15;
static const uint8_t A16  = PIN_A16;
static const uint8_t A17  = PIN_A17;
static const uint8_t A18  = PIN_A18;
static const uint8_t A19  = PIN_A19;
static const uint8_t A20  = PIN_A20;

/* Direct ADC channel identifiers (ADC_CH() sets the 0x80 "this is a channel" flag). */
#define AIN0   ADC_CH(0)
#define AIN1   ADC_CH(1)
#define AIN2   ADC_CH(2)
#define AIN3   ADC_CH(3)
#define AIN4   ADC_CH(4)
#define AIN5   ADC_CH(5)
#define AIN6   ADC_CH(6)
#define AIN7   ADC_CH(7)
#define AIN16  ADC_CH(16)
#define AIN17  ADC_CH(17)
#define AIN18  ADC_CH(18)
#define AIN19  ADC_CH(19)
#define AIN20  ADC_CH(20)
#define AIN21  ADC_CH(21)
#define AIN22  ADC_CH(22)
#define AIN23  ADC_CH(23)
#define AIN24  ADC_CH(24)
#define AIN25  ADC_CH(25)
#define AIN26  ADC_CH(26)
#define AIN27  ADC_CH(27)
#define AIN31  ADC_CH(31)

         /*##  ### #   #      ###  ####  ####   ###  #   #  ###
          #   #  #  ##  #     #   # #   # #   # #   #  # #  #
          ####   #  # # #     ##### ####  ####  #####   #    ###
          #      #  #  ##     #   # #  #  #  #  #   #   #       #
          #     ### #   #     #   # #   # #   # #   #   #    # */
#ifdef ARDUINO_MAIN
  // Indexed by digital pin number (0..33). Gaps are NOT_A_PORT.
  const uint8_t digital_pin_to_port[] = {
    PA,         //  0 PA5  D0 RX (Serial1)
    PA,         //  1 PA4  D1 TX (Serial1)
    PA,         //  2 PA2  D2 SDA  (TCB0 WO - TCB0 is millis on this board)
    PA,         //  3 PA3  D3 SCL  (TCB1 WO - default PWM outlet, exclusive with D4/D7)
    PC,         //  4 PC3  D4      (TCB1 PWM via CCL LUT1 - exclusive with D3/D7)
    PD,         //  5 PD0  D5  (TCA0 WO0, dynamic)
    PD,         //  6 PD1  D6  (TCA0 WO1, dynamic)
    PA,         //  7 PA6  D7 XCK  (TCB1 PWM via CCL LUT0 alt - exclusive with D3/D4)
    PA,         //  8 PA7  D8 XDIR/AC0/EVOUTA
    PD,         //  9 PD2  D9  (TCA0 WO2, dynamic)
    PD,         // 10 PD3  D10 (TCA0 WO3, dynamic)
    NOT_A_PORT, // 11 (gap)
    NOT_A_PORT, // 12 (gap)
    NOT_A_PORT, // 13 (gap)
    PD,         // 14 PD5  D14 MISO (TCA0 WO5, dynamic)
    PD,         // 15 PD6  D15 SCK/Serial2 TX
    PD,         // 16 PD4  D16 MOSI (TCA0 WO4, dynamic)
    PF,         // 17 PF3  D17 LED_BUILTIN
    PD,         // 18 PD7  D18 A0/SS/Serial2 RX
    PF,         // 19 PF0  D19 A1
    PF,         // 20 PF1  D20 A2
    PF,         // 21 PF2  D21 A3/EVOUTF
    PF,         // 22 PF4  D22 A4 (test pad)
    PF,         // 23 PF5  D23 A5 (test pad)
    NOT_A_PORT, // 24 (gap)
    NOT_A_PORT, // 25 (gap)
    NOT_A_PORT, // 26 (gap)
    NOT_A_PORT, // 27 (gap)
    NOT_A_PORT, // 28 (gap)
    NOT_A_PORT, // 29 (gap)
    PA,         // 30 PA0  D30 TX LED
    PA,         // 31 PA1  D31 RX LED
    PF,         // 32 PF6  RESET
    PF          // 33 PF7  UPDI
  };

  /* Bit position within the port (for PINnCTRL access). */
  const uint8_t digital_pin_to_bit_position[] = {
    PIN5_bp,   //  0 PA5  D0 RX (Serial1)
    PIN4_bp,   //  1 PA4  D1 TX (Serial1)
    PIN2_bp,   //  2 PA2  D2 SDA  (TCB0 WO - TCB0 is millis on this board)
    PIN3_bp,   //  3 PA3  D3 SCL  (TCB1 WO - default PWM outlet, exclusive with D4/D7)
    PIN3_bp,   //  4 PC3  D4      (TCB1 PWM via CCL LUT1 - exclusive with D3/D7)
    PIN0_bp,   //  5 PD0  D5  (TCA0 WO0, dynamic)
    PIN1_bp,   //  6 PD1  D6  (TCA0 WO1, dynamic)
    PIN6_bp,   //  7 PA6  D7 XCK  (TCB1 PWM via CCL LUT0 alt - exclusive with D3/D4)
    PIN7_bp,   //  8 PA7  D8 XDIR/AC0/EVOUTA
    PIN2_bp,   //  9 PD2  D9  (TCA0 WO2, dynamic)
    PIN3_bp,   // 10 PD3  D10 (TCA0 WO3, dynamic)
    NOT_A_PIN, // 11 (gap)
    NOT_A_PIN, // 12 (gap)
    NOT_A_PIN, // 13 (gap)
    PIN5_bp,   // 14 PD5  D14 MISO (TCA0 WO5, dynamic)
    PIN6_bp,   // 15 PD6  D15 SCK/Serial2 TX
    PIN4_bp,   // 16 PD4  D16 MOSI (TCA0 WO4, dynamic)
    PIN3_bp,   // 17 PF3  D17 LED_BUILTIN
    PIN7_bp,   // 18 PD7  D18 A0/SS/Serial2 RX
    PIN0_bp,   // 19 PF0  D19 A1
    PIN1_bp,   // 20 PF1  D20 A2
    PIN2_bp,   // 21 PF2  D21 A3/EVOUTF
    PIN4_bp,   // 22 PF4  D22 A4 (test pad)
    PIN5_bp,   // 23 PF5  D23 A5 (test pad)
    NOT_A_PIN, // 24 (gap)
    NOT_A_PIN, // 25 (gap)
    NOT_A_PIN, // 26 (gap)
    NOT_A_PIN, // 27 (gap)
    NOT_A_PIN, // 28 (gap)
    NOT_A_PIN, // 29 (gap)
    PIN0_bp,   // 30 PA0  D30 TX LED
    PIN1_bp,   // 31 PA1  D31 RX LED
    PIN6_bp,   // 32 PF6  RESET
    PIN7_bp    // 33 PF7  UPDI
  };

  const uint8_t digital_pin_to_bit_mask[] = {
    PIN5_bm,   //  0 PA5  D0 RX (Serial1)
    PIN4_bm,   //  1 PA4  D1 TX (Serial1)
    PIN2_bm,   //  2 PA2  D2 SDA  (TCB0 WO - TCB0 is millis on this board)
    PIN3_bm,   //  3 PA3  D3 SCL  (TCB1 WO - default PWM outlet, exclusive with D4/D7)
    PIN3_bm,   //  4 PC3  D4      (TCB1 PWM via CCL LUT1 - exclusive with D3/D7)
    PIN0_bm,   //  5 PD0  D5  (TCA0 WO0, dynamic)
    PIN1_bm,   //  6 PD1  D6  (TCA0 WO1, dynamic)
    PIN6_bm,   //  7 PA6  D7 XCK  (TCB1 PWM via CCL LUT0 alt - exclusive with D3/D4)
    PIN7_bm,   //  8 PA7  D8 XDIR/AC0/EVOUTA
    PIN2_bm,   //  9 PD2  D9  (TCA0 WO2, dynamic)
    PIN3_bm,   // 10 PD3  D10 (TCA0 WO3, dynamic)
    NOT_A_PIN, // 11 (gap)
    NOT_A_PIN, // 12 (gap)
    NOT_A_PIN, // 13 (gap)
    PIN5_bm,   // 14 PD5  D14 MISO (TCA0 WO5, dynamic)
    PIN6_bm,   // 15 PD6  D15 SCK/Serial2 TX
    PIN4_bm,   // 16 PD4  D16 MOSI (TCA0 WO4, dynamic)
    PIN3_bm,   // 17 PF3  D17 LED_BUILTIN
    PIN7_bm,   // 18 PD7  D18 A0/SS/Serial2 RX
    PIN0_bm,   // 19 PF0  D19 A1
    PIN1_bm,   // 20 PF1  D20 A2
    PIN2_bm,   // 21 PF2  D21 A3/EVOUTF
    PIN4_bm,   // 22 PF4  D22 A4 (test pad)
    PIN5_bm,   // 23 PF5  D23 A5 (test pad)
    NOT_A_PIN, // 24 (gap)
    NOT_A_PIN, // 25 (gap)
    NOT_A_PIN, // 26 (gap)
    NOT_A_PIN, // 27 (gap)
    NOT_A_PIN, // 28 (gap)
    NOT_A_PIN, // 29 (gap)
    PIN0_bm,   // 30 PA0  D30 TX LED
    PIN1_bm,   // 31 PA1  D31 RX LED
    PIN6_bm,   // 32 PF6  RESET
    PIN7_bm    // 33 PF7  UPDI
  };

  /* TCA0 PWM is resolved dynamically from PORTMUX, so TCA0 pins are NOT_ON_TIMER
   * here. TIMERB1 is set on all three TCB1 outlets (D3 = WO, D4 = LUT1-OUT,
   * D7 = LUT0-OUT alt): the core's TCB analogWrite() path then asks the
   * WAZAMONO_TCB1_PWMMUX hook (wazamono_lutpwm.c) to open the right outlet. */
  const uint8_t digital_pin_to_timer[] = {
    NOT_ON_TIMER, //  0 PA5  D0 RX (Serial1)
    NOT_ON_TIMER, //  1 PA4  D1 TX (Serial1)
    TIMERB0,      //  2 PA2  D2 SDA  (TCB0 WO - TCB0 is millis on this board)
    TIMERB1,      //  3 PA3  D3 SCL  (TCB1 WO - default PWM outlet, exclusive with D4/D7)
    TIMERB1,      //  4 PC3  D4      (TCB1 PWM via CCL LUT1 - exclusive with D3/D7)
    NOT_ON_TIMER, //  5 PD0  D5  (TCA0 WO0, dynamic)
    NOT_ON_TIMER, //  6 PD1  D6  (TCA0 WO1, dynamic)
    TIMERB1,      //  7 PA6  D7 XCK  (TCB1 PWM via CCL LUT0 alt - exclusive with D3/D4)
    NOT_ON_TIMER, //  8 PA7  D8 XDIR/AC0/EVOUTA
    NOT_ON_TIMER, //  9 PD2  D9  (TCA0 WO2, dynamic)
    NOT_ON_TIMER, // 10 PD3  D10 (TCA0 WO3, dynamic)
    NOT_ON_TIMER, // 11 (gap)
    NOT_ON_TIMER, // 12 (gap)
    NOT_ON_TIMER, // 13 (gap)
    NOT_ON_TIMER, // 14 PD5  D14 MISO (TCA0 WO5, dynamic)
    NOT_ON_TIMER, // 15 PD6  D15 SCK/Serial2 TX
    NOT_ON_TIMER, // 16 PD4  D16 MOSI (TCA0 WO4, dynamic)
    NOT_ON_TIMER, // 17 PF3  D17 LED_BUILTIN
    NOT_ON_TIMER, // 18 PD7  D18 A0/SS/Serial2 RX
    NOT_ON_TIMER, // 19 PF0  D19 A1
    NOT_ON_TIMER, // 20 PF1  D20 A2
    NOT_ON_TIMER, // 21 PF2  D21 A3/EVOUTF
    NOT_ON_TIMER, // 22 PF4  D22 A4 (test pad)
    NOT_ON_TIMER, // 23 PF5  D23 A5 (test pad)
    NOT_ON_TIMER, // 24 (gap)
    NOT_ON_TIMER, // 25 (gap)
    NOT_ON_TIMER, // 26 (gap)
    NOT_ON_TIMER, // 27 (gap)
    NOT_ON_TIMER, // 28 (gap)
    NOT_ON_TIMER, // 29 (gap)
    NOT_ON_TIMER, // 30 PA0  D30 TX LED
    NOT_ON_TIMER, // 31 PA1  D31 RX LED
    NOT_ON_TIMER, // 32 PF6  RESET
    NOT_ON_TIMER  // 33 PF7  UPDI
  };
#endif

